Conf.Simple/src/InformationRegisters/SUI_docs_tbl_series/SUI_docs_tbl_series.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_series</name>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <comment>Склад</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty</name>
    <comment>Количество</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>best_before</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>production_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_series/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверить SID
		ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
			ПолноеИмяМетаданных);
			
		// Проверить SID документа
		ОбщегоНазначенияКлиентСервер.Проверить(
			СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid_doc),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор документа (%1) не является идентификатором'"), Запись.sid_doc),
			ПолноеИмяМетаданных);
		
		// Проверить ID номенклатуры
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good),
			СтрШаблон(НСтр("ru = 'Идентификатор номенклатуры (%1) не является идентификатором Simple'"), Запись.id_good),
			ПолноеИмяМетаданных);
		
		// Проверить ID характеристики
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_properties) Тогда
			Запись.id_properties = "";
		КонецЕсли;
		
		// Проверить ID серии
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_series) Тогда
			Запись.id_series = "";
		КонецЕсли;
		
		// Проверить ID виды цены
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_warehouse) Тогда
			Запись.id_warehouse = "";
		КонецЕсли;
		
		// Обновить значение Дата обновления
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
